Repository: leandrohsilveira/timesheetmanager
Catalog: translations/*/LC_MESSAGES/django.po
Languages: pt_br

source: ViewIdMixin must be mixed with an class that has a 'get_context_data' method.
pt_br: ViewIdMixin deve ser misturada a uma classe que possui um método chamado 'get_context_data'.

source: The model atribute is required.
pt_br: O atributo 'model' é obrigatório.

source: A 'pk' kwarg is required.
pt_br: Um kwarg com chave 'pk' é obrigatório.

source: toggle navigation
pt_br: exibir/esconder navegação

source: applications
pt_br: aplicações

source: switch language
pt_br: trocar idioma

source: choose a language
pt_br: escolha um idioma

source: submit
pt_br: submeter

source: cancel
pt_br: cancelar

# paginator template
source: displaying %(first)s of %(count)s item.
pt_br: exibindo %(first)s de %(count)s item.

source: first
pt_br: primeiro

source: previous
pt_br: anterior

source: next
pt_br: próximo

source: last
pt_br: último

source: required fields
pt_br: campos obrigatórios

source: created new %(content_type_name)s: "%(object_str)s".
pt_br: novo %(content_type_name)s criado: "%(object_str)s"

source: modified %(content_type_name)s: "%(object_str)s".
pt_br: %(content_type_name)s atualizado: "%(object_str)s"

source: HistoryEntry< id: %(pk)d, message_template: %(message_template)s, parameters: %(parameters)s, content_type: %(content_type)s. >
pt_br: EntradaHistorico< id: %(pk)d, template_mensagem: %(message_template)s, parametros: %(parameters)s, tipo_conteudo: %(content_type)s.

source: home
pt_br: início

source: system history entries
pt_br: históricos do sistema

source: are you sure that you wish to delete this history entry?
pt_br: você tem certeza que deseja excluir esta entrada de histórico?

source: event time
pt_br: ocorrido em

source: made by
pt_br: feito por

source: message
pt_br: mensagem

source: no results to show
pt_br: nenhum resultado para exibir

source: the history entry was successfully deleted!
pt_br: os dados do usuário atualizados com sucesso!

source: Password
pt_br: Senha

source: Raw passwords are not stored, so there is no way to see this user's password, but you can change the password using <a href="password">this form</a>.
pt_br: Não são armazenadas senhas desprotegidas e, por isso, não há como visualizar a senha de um usuário, mas você pode alterá-la utilizando <a href="password">este formulário</a>.

source: users
pt_br: usuários

source: change password
pt_br: trocar senha

# change password
source: of %(first_name)s
pt_br: de %(first_name)s

source: save
pt_br: salvar

source: %(first_name)s's user data
pt_br: dados do usuário %(first_name)s

source: my user
pt_br: meu usuário

source: full name
pt_br: nome completo

source: e-mail address
pt_br: endereço de e-mail

source: username
pt_br: usuário

source: sign up date
pt_br: data de cadastro

source: last login
pt_br: último login

source: never logged in
pt_br: nunca fez login

source: update user's data
pt_br: atualizar dados do usuário

source: user form
pt_br: formulário de usuário

source: users list
pt_br: lista de usuários

source: new user
pt_br: novo usuário

source: user data
pt_br: dados do usuário

source: not provided yet
pt_br: ainda não fornecido

source: session terminated.
pt_br: sessão terminada

source: thank you for visiting our application, come back soon
pt_br: obrigado por visitar nossa aplicação, volte em breve

source: sign in again
pt_br: entrar novamente

source: switch user
pt_br: trocar de usuário

source: sign in
pt_br: entrar

source: sign up
pt_br: cadastre-se

source: logout
pt_br: sair

source: all history entries
pt_br: todas entradas de histórico

source: my history entries
pt_br: minhas entradas de histórico

source: history manager
pt_br: gerenciador de histórico

source: user manager
pt_br: gerenciador de usuário

source: administration
pt_br: administração

source: %(user_first_name)s has signed up.
pt_br: %(user_first_name)s cadastrou-se

source: %(user_first_name)s has created a new user named "%(changed_user_first_name)s".
pt_br: %(user_first_name)s criou um novo usuário chamado "%(changed_user_first_name)s".

source: %(user_first_name)s has updated "%(changed_user_first_name)s" user's data.
pt_br: %(user_first_name)s atualizou os dados do usuário "%(changed_user_first_name)s".

source: %(user_first_name)s has updated "%(changed_user_first_name)s" user password.
pt_br: %(user_first_name)s alterou a senha do usuário "%(changed_user_first_name)s".

source: %(user_first_name)s has updated own user's data.
pt_br: %(user_first_name)s atualizou os dados do próprio usuário.

source: %(user_first_name)s has updated own user's password.
pt_br: %(user_first_name)s atualizou a senha do próprio usuário.

source: user successfully created!
pt_br: usuário cadastrado com sucesso!

source: create new users
pt_br: cadastrar novos usuários no sistema

source: user data successfully updated!
pt_br: dados de usuário atualizados com sucesso!

source: change other users data
pt_br: atualizar os dados de outros usuários do sistema

source: see other users data
pt_br: visualizar os dados de outros usuários do sistema

source: user password successfully updated!
pt_br: senha de usuário alterada com sucesso!

source: change other users password
pt_br: alterar a senha de outros usuários

source: your user data were successfully updated!
pt_br: seus dados de usuário foram atualizados com sucesso!

source: your password were successfully updated!
pt_br: sua senha foi alterada com sucesso!

source: see all system users
pt_br: visualizar todos os usuários do sistema

source: access denied, please provide the credentials of a user who has permission to %(message)s.
pt_br: acesso negado, por favor, forneça as credenciais de um usuário que possui permissão para %(message)s
